// Напишите программу, которая на вход принимает число и выдает, является ли оно чётным
Console.WriteLine("Введите число");
int A = Convert.ToInt32(Console.ReadLine());
if (A%2 == 0){
    Console.WriteLine("Введенное число является чётным");
}
else {
Console.WriteLine("Введенное число является нечётным");
}
